Repository: openvanilla/openvanilla
Catalog: Modules/Experiments/OVIMRomanNewStatic/hunspell-1.2.1/po/*.po
Languages: hu

source: Line %d: %s -> %s
hu: %d. sor: %s -> %s

source: FORBIDDEN!
hu: TILTOTT!

source: %s File: %s
hu: %s Fájl: %s

source: [SP] <number> R)epl A)ccept I)nsert L)ookup U)ncap Q)uit e(X)it or ? for help
hu: Szóköz=tovább <szám> C)sere J)ó F)elvesz K)isbetûvel T)õ M)égsem V)ége ?=Súgó

source: Whenever a word is found that is not in the dictionary
hu: A hibás, vagy fel nem ismert szavak az elsõ sorban jelennek meg.

source: it is printed on the first line of the screen. If the dictionary
hu: Amennyiben van javítási javaslat, az számozott lista formájában

source: contains any similar words, they are listed with a number
hu: jelenik meg. A sorszám leütésével választhatunk ki ezek közül

source: next to each one. You have the option of replacing the word
hu: egyet, de megadhatunk akár egy új szót is.

source: completely, or choosing one of the suggested words.
hu: Részletes leírás a program lehetõségeirõl: man hunspell.

source: Commands are:
hu: Billentyûparancsok:

source: R Replace the misspelled word completely.
hu: C A hibás szó kicserélése egy megadott szóra.

source: Space Accept the word this time only.
hu: Szóköz A szó egyszeri átugrása változtatás nélkül.

source: A Accept the word for the rest of this session.
hu: J A szó minden elõfordulását jónak tekinti a program futása során.

source: I Accept the word, and put it in your private dictionary.
hu: F A szót felveszi a saját szótárba, így új indításkor is ismerni fogja.

source: U Accept and add lowercase version to private dictionary.
hu: K Mint az elõzõ, de a szót kisbetûsen veszi fel a saját szótárba.

source: O Ask two words. First word will accepted with 2nd's affixes too.
hu: T Szótõ és minta bekérése. A szótõ a minta toldalékaival is elfogadásra kerül.

source: 0-n Replace with one of the suggested words.
hu: 0-n A javasolt szavak közül az adott sorszámúra cserél.

source: L Look up words in system dictionary.
hu: L Szó, vagy minta alapján szûri a rendszer szótárát.

source: X Write the rest of this file, ignoring misspellings, and start next file.
hu: V Menti az eddigi javításokat, és rátér a következõ fájlra.

source: Q Quit immediately. Asks for confirmation. Leaves file unchanged.
hu: M Kilép a javítások mentése nélkül, de elõtte megerõsítést kér.

source: ! Shell escape.
hu: H Ideiglenes kilépés a héjba.

source: ^L Redraw screen
hu: ^L A képernyõ újrarajzolása.

source: ^Z Suspend program. Restart with fg command.
hu: ^Z A program felfüggesztése. Újraindítás fg paranccsal.

source: ? Show this help screen.
hu: ? Ennek a leírásnak a megjelenítése.

source: -- Type space to continue --
hu: -- Továbblépés a szóköz billentyû leütésével --

source: r
hu: c

source: Replace with:
hu: Csere:

source: u
hu: k

source: i
hu: f

source: Cannot update personal dictionary.
hu: Nem lehet frissíteni a saját szótárat.

source: a
hu: j

source: o
hu: t

source: New root word:
hu: Új szótõ:

source: Pattern word:
hu: Minta (ami alapján ragozva lesz a szótõ):

source: Pattern word must be in the dictionary. Press any key!
hu: A minta szótári szó kell hogy legyen! Továbblépés billentyûleütéssel.

source: x
hu: v

source: q
hu: m

source: Are you sure you want to throw away your changes?
hu: Kilép a módosítások mentése nélkül (i/n)?

source: y
hu: i

source: Can't create tempfile %s.
hu: Nem lehet létrehozni a(z) %s átmeneti fájlt.

source: Usage: hunspell [OPTION]... [FILE]...
hu: Használat: hunspell [KAPCSOLÓ]... [FÁJL]...

source: Check spelling of each FILE. Without FILE, check standard input.
hu: A FÁJL(OK) (ennek hiányában a szabványos bemenet) helyesírását ellenõrzi.

source: -1 check only first field in lines (delimiter = tabulator)
hu: -1 csak az elsõ mezõt ellenõrzi a sorban (mezõhatároló = tabulátor)

source: -a Ispell's pipe interface
hu: -a Ispell-szerû csõfelület

source: -d dict use dict dictionary
hu: -d tár a tár nevû szótárat használja

source: -G print only correct words or lines
hu: -G kiírja a bemenet helyes szavait vagy sorait

source: -h, --help display this help and exit
hu: -h, --help kiírja ezt a leírást

source: -H HTML input file format
hu: -H HTML bemeneti formátum

source: -l print mispelled words
hu: -l kiírja a hibás szavakat

source: -L print lines with mispelled words
hu: -L kiírja a hibás sorokat

source: -n nroff/troff input file format
hu: -n nroff/troff bemeneti formátum

source: -p dict set dict custom dictionary
hu: -p tár a tár nevû saját szótárat használja

source: -t TeX/LaTeX input file format
hu: -t TeX/LaTeX bemeneti formátum

source: -u show typical misspellings
hu: -u kiírja a tipikus tévesztéseket

source: -u2 print typical misspellings in sed format
hu: -u2 kiírja a tipikus tévesztéseket sed formátumban

source: -U automatic correction of typical misspellings to stdout
hu: -U kiírja az automatikusan javított fájlt

source: -v, --version print version number
hu: -v, --version kiírja a változat számát

source: -vv print Ispell compatible version number
hu: -vv kiírja a változat számát Ispell-szerûen

source: -w print mispelled words (= lines) from one word/line input.
hu: -w kiírja a hibás szavakat a soronként egy szavas bemenetbõl.

source: hunspell -l file.txt # print misspelled words
hu: hunspell -l fájl.txt # kiírja a hibás szavakat

source: hunspell -u file.txt # print typical (=serious) misspellings
hu: hunspell -u fájl.txt # kiírja a tipikus (=súlyos) hibákat

source: Based on OpenOffice.org's Myspell library.
hu: Az OpenOffice.org Myspell programkönyvtárán alapul.

source: Myspell's copyright (C) Kevin Hendricks, 2001-2002, License: BSD.
hu: MySpell copyright (C) Kevin Hendricks, 2001-2002, Licenc: BSD.

source: This is free software; see the source for copying conditions. There is NO
hu: Ez egy szabad szoftver: lásd a forráskódot a licencfeltételekrõl.

source: warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE,
hu: NINCS garancia, még az eladhatóságra vagy valamely célra való

source: to the extent permitted by law.
hu: alkalmazhatóságra sem.

source: Can't open %s.
hu: Nem lehet megnyitni a(z) %s-t.

source: Can't open affix or dictionary files.
hu: Nem lehet megnyitni a ragozási vagy a szótárfájlt.

source: Hunspell has been compiled without Ncurses user interface.
hu: A Hunspell Ncurses felhasználói felület nélkül lett fordítva.
